app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "testing123"], ["text", "test"], ["created_at", "2020-08-02 03:59:36.063615"], ["updated_at", "2020-08-02 03:59:36.063615"]]