app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "new comm"], ["body", "comm test"], ["article_id", 2], ["created_at", "2020-08-02 04:14:25.101614"], ["updated_at", "2020-08-02 04:14:25.101614"]]
---
    def create
        # creating a new comment
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)